INSERT INTO categories (name) VALUES
('Дзюдоги'),
('Пояса'),
('Маты'),
('Аксессуары'),
('Защита'),
('Книги и DVD'),
('Спортивные бутылки');

INSERT INTO products (product_name, price, stock_quantity, category_id) VALUES
('Белый дзюдоги', 5000, 20, 1),
('Синий дзюдоги', 5500, 15, 1),
('Красный дзюдоги', 6000, 10, 1),
('Черный пояс', 1000, 50, 2),
('Коричневый пояс', 800, 40, 2),
('Синий пояс', 700, 45, 2),
('Маты для татами 2x2 м', 15000, 5, 3),
('Маты для татами 1x1 м', 8000, 10, 3),
('Сумка для дзюдо', 3000, 25, 4),
('Наручники для тренировки', 1500, 30, 4),
('Защитный жилет', 4500, 10, 5),
('Шлем для дзюдо', 3500, 12, 5),
('Книга "Искусство дзюдо"', 1200, 20, 6),
('DVD "Техники дзюдо"', 1000, 15, 6),
('Спортивная бутылка 0.5 л', 500, 50, 7),
('Спортивная бутылка 1 л', 700, 40, 7);


--INSERT INTO customers (name, email, city, phone_number) VALUES
--('Иван Иванов', 'ivan.ivanov@example.com', 'Москва', '+7-495-123-4567'),
--('Мария Смирнова', 'maria.smirnova@example.com', 'Санкт-Петербург', '+7-812-765-4321'),
--('Алексей Петров', 'alexey.petrov@example.com', 'Новосибирск', '+7-383-555-1234');

INSERT INTO order_statuses (name) VALUES
('Завершен'),
('В ожидании'),
('Отправлен');

--INSERT INTO orders (orders_date, total_price, status_id, customer_id) VALUES
--('2024-01-15 10:00:00', 10500, 1, 1),
--('2024-02-20 15:30:00', 8500, 2, 2),
--('2024-03-10 09:45:00', 3000, 3, 3);

--INSERT INTO order_items (orders_id, products_id, quantity) VALUES
--(1, 1, 1),
--(1, 2, 1),
--(2, 3, 5),
--(2, 4, 1),
--(3, 5, 1);
